tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "supabase/tap"
brew "jpeg-xl"
brew "aom"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "glib"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "curl"
brew "deno"
brew "eza"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "libavif"
brew "gh"
brew "git"
brew "git-flow"
brew "gnupg"
brew "go"
brew "openjdk"
brew "gradle"
brew "grep"
brew "jq"
brew "lazygit"
brew "librsvg"
brew "lolcat"
brew "luv"
brew "mas"
brew "mkcert"
brew "moreutils"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "node"
brew "nss"
brew "openjdk@11"
brew "openjdk@17"
brew "pdsh"
brew "php"
brew "pillow"
brew "pinentry-mac"
brew "pipenv"
brew "pngpaste"
brew "pnpm"
brew "pyenv"
brew "pyvim"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "stylua"
brew "tldr"
brew "tmux"
brew "tre-command"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "zk"
brew "zoxide"
brew "zsh"
brew "osx-cross/avr/avr-gcc@8"
brew "osx-cross/avr/avr-gcc@9"
brew "qmk/qmk/qmk"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "bartender"
cask "brave-browser"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "gcc-arm-embedded"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hammerspoon"
cask "istat-menus"
cask "keycastr"
cask "kicad"
cask "krisp"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "nordvpn"
cask "obsidian"
cask "openscad"
cask "opera"
cask "polypane"
cask "postman"
cask "slack"
cask "spotify"
cask "tableplus"
cask "telegram-desktop"
cask "uhk-agent"
cask "visual-studio-code"
cask "webstorm"
cask "wezterm"
cask "whatsapp"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
vscode "alefragnani.project-manager"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hoovercj.vscode-power-mode"
vscode "humao.rest-client"
vscode "jevakallio.vscode-hacker-typer"
vscode "kruemelkatze.vscode-dashboard"
vscode "kumar-harsh.graphql-for-vscode"
vscode "lokalise.i18n-ally"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "quicktype.quicktype"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "selemondev.vscode-shadcn-svelte"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "wakatime.vscode-wakatime"
vscode "wallabyjs.console-ninja"
vscode "wallabyjs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
vscode "znck.grammarly"
