tap "adoptopenjdk/openjdk"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "supabase/tap"
brew "jpeg-xl"
brew "aom"
brew "atuin", restart_service: :changed
brew "awscli"
brew "bat"
brew "glib"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "deno"
brew "eza"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "libavif"
brew "gh"
brew "git"
brew "git-flow"
brew "gnupg"
brew "go"
brew "openjdk"
brew "gradle"
brew "grep"
brew "helix"
brew "jq"
brew "lazygit"
brew "librsvg"
brew "ltex-ls"
brew "luarocks"
brew "luv"
brew "mas"
brew "mkcert"
brew "moreutils"
brew "neovim"
brew "ninja"
brew "nss"
brew "openjdk@11"
brew "openjdk@17"
brew "pdsh"
brew "php"
brew "pillow"
brew "pinentry-mac"
brew "pipenv"
brew "pngpaste"
brew "pnpm"
brew "pyenv"
brew "python@3.11"
brew "pyvim"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "stylua"
brew "tldr"
brew "tmux"
brew "tre-command"
brew "tree"
brew "watch"
brew "wget"
brew "yarn"
brew "yq"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
brew "osx-cross/avr/avr-gcc@8"
brew "osx-cross/avr/avr-gcc@9"
brew "supabase/tap/supabase"
cask "1password"
cask "aerospace"
cask "aptible"
cask "arc"
cask "discord"
cask "displaylink"
cask "docker"
cask "figma"
cask "font-fira-code-nerd-font"
cask "gcc-arm-embedded"
cask "gpg-suite"
cask "istat-menus"
cask "keycastr"
cask "kitty"
cask "krisp"
cask "nordvpn"
cask "obsidian"
cask "polypane"
cask "raycast"
cask "slack"
cask "spotify"
cask "tableplus"
cask "telegram-desktop"
cask "uhk-agent"
cask "visual-studio-code"
cask "webstorm"
cask "whatsapp"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
