tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "readline"
brew "awscli"
brew "bat"
brew "glib"
brew "cmake"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "eza"
brew "harfbuzz"
brew "pango"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gh"
brew "git"
brew "git-flow"
brew "gnupg"
brew "go"
brew "openjdk"
brew "gradle"
brew "grep"
brew "jq"
brew "lazygit"
brew "librsvg"
brew "lolcat"
brew "luv"
brew "mas"
brew "mkcert"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "ninja"
brew "node"
brew "nss"
brew "openjdk@11"
brew "openjdk@17"
brew "pdsh"
brew "php"
brew "pinentry-mac"
brew "pipenv"
brew "pnpm"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "pyvim"
brew "ranger"
brew "redis"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stow"
brew "stylua"
brew "tldr"
brew "tmux"
brew "tre-command"
brew "tree"
brew "watch"
brew "wget"
brew "zk"
brew "zsh"
brew "osx-cross/avr/avr-gcc@8"
brew "qmk/qmk/qmk"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "aptible"
cask "bartender"
cask "brave-browser"
cask "discord"
cask "displaylink"
cask "figma"
cask "firefox"
cask "font-fira-code-nerd-font"
cask "gcc-arm-embedded"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "grammarly"
cask "istat-menus"
cask "iterm2"
cask "keycastr"
cask "krisp"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
cask "obsidian"
cask "opera"
cask "polypane"
cask "postman"
cask "slack"
cask "spotify"
cask "tableplus"
cask "telegram-desktop"
cask "uhk-agent"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "whatsapp"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
vscode "alexcvzz.vscode-sqlite"
vscode "anseki.vscode-color"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "DigitalBrainstem.javascript-ejs-support"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hoovercj.vscode-power-mode"
vscode "humao.rest-client"
vscode "janisdd.vscode-edit-csv"
vscode "jevakallio.vscode-hacker-typer"
vscode "kruemelkatze.vscode-dashboard"
vscode "kumar-harsh.graphql-for-vscode"
vscode "luqimin.velocity"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "moalamri.inline-fold"
vscode "mrmlnc.vscode-json5"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-spanish"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "theBenForce.appsync-resolver-autocomplete"
vscode "toba.vsfire"
vscode "unifiedjs.vscode-mdx"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "WakaTime.vscode-wakatime"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.quokka-vscode"
vscode "wesbos.theme-cobalt2"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "Zignd.html-css-class-completion"
vscode "ZixuanChen.vitest-explorer"
vscode "znck.grammarly"
